list_1 = [1,3,5,7,9,9]
list_2 = [1,2,4,5,11,9]

#числа, що містяться одночасно як у першому списку, так і в другому
result_1 = list(set(list_1) & set(list_2 ))
#числа, що містяться в першому, але відсутні в другому
result_2 = list(set(list_1) - set(list_2 ))
#тільки унікальні для першого та другого списків
#result_3 = list(set(list_1 + list_2))
result_3 = (set(list_1) | set(list_2)) - (set(list_1) & set(list_2))
print('Числа, що містяться одночасно як у першому списку, так і в другому:', result_1)
print('Числа, що містяться в першому, але відсутні в другому', result_2)
print('Унікальні числа для першого та другого списківL', result_3)

