enter_value_text = "I Love python"

#Виведіть третій символ цього рядка.
print(enter_value_text[2])
# виведіть передостанній символ цього рядка.
print(enter_value_text[-2])
# #виведіть перші п'ять символів цього рядка.
print(enter_value_text[0:5])
#виведіть весь рядок, крім двох останніх символів.
print(enter_value_text[0:-2])
#виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
print(enter_value_text[::2])
#виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
print(enter_value_text[1::2])
#виведіть усі символи у зворотному порядку.
print(enter_value_text[1::2])
#виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
print(enter_value_text[::-1])
#виведіть довжину цього рядка.
print(len(enter_value_text))