

##############################################################################
############                                                     #############
############                      TASK 4                         #############
############                   HAVE FUN WITH                     #############
############                     MONGO DB                        #############
##############################################################################
'''
токен пропишіть як констнанту в окремому файлі конфігів,
назву бд та колекції також тримати в файлі конфігів





id не відправляйте, нехай формується автоматично


напишіть функцію, котра отримує всі дані з бази даних (назва бд та колекції
у вас в конфігах)
'''
import mongoDB_config


#написати функцію, яка підєднується за токеном до бази даних, створює базу даних, колекцію.

def create_db_collection (token) -> None:
    """
    Create DB and Collection
    Args:
        token:

    Returns:

    """
    mongoDB_config.coll.insert_one({"name": "task_4"})


#доробити функцію з завдання 3: якщо bd True, то ми формуємо ту ж стрічку(проте без смайла, можете передбачити в колекції смайлів смайл як пуста
#стрічка), і записуємо в базу даних або по одному валідні json дані, або ж
#добавляємо їх в список  і використовуємо insert_many
#зауважте, що ви відправляєте замість notes тест нашої стрічки до 150 символів,
#інші поля залишаються без змін

